jorgebucaran/fisher
PatrickF1/fzf.fish
jorgebucaran/autopair.fish
franciscolourenco/done
decors/fish-colored-man
jorgebucaran/puffer.fish
gazorby/fish-abbreviation-tips
meaningful-ooo/sponge
oh-my-fish/plugin-foreign-env
