# ── Shell ────────────────────────────────────
brew "fish"
brew "starship"

# ── Git / VCS ─────────────────────────────────
brew "git"
brew "git-delta"  # 高機能 diff viewer
brew "lazygit"
brew "jj"
brew "lazyjj"

# ── Language version manager ──────────────────
brew "mise"

# ── CLI tools ─────────────────────────────────
brew "eza"
brew "bat"
brew "zoxide"
brew "fzf"
brew "fd"        # fzf のファイル検索バックエンド
brew "ripgrep"   # 高速 grep
brew "dust"
brew "gping"

# ── Editor ────────────────────────────────────
brew "helix"

# ── Docker TUI ────────────────────────────────
brew "lazydocker"

# ── データサイエンス / ML ──────────────────────
brew "jq"        # JSON 処理（API レスポンス・設定ファイル操作）
brew "uv"        # 高速 Python パッケージマネージャ（pip/venv 代替）
brew "duckdb"    # ローカル Parquet/CSV への OLAP SQL 分析
brew "git-lfs"   # 大容量ファイル管理（モデル重みデータ・データセット）
brew "bottom"    # システムモニタ（学習中の CPU/メモリ/GPU 確認、コマンド: btm）
brew "just"      # タスクランナー（実験コマンドの Makefile 代替）

# ── 言語ツール（Helix LSP連携）───────────────
brew "ruff"
brew "pyright"
brew "shfmt"
brew "marksman"   # Markdown LSP
brew "prettier"   # Markdown / JS / TS フォーマッタ
